yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_pio0.h
#define RP2040_PIO0_SM2_ADDR_MASK                    (0x1f)

#define RP2040_PIO0_SM2_INSTR_MASK                   (0xffff)

#define RP2040_PIO0_SM2_PINCTRL_SIDESET_COUNT_SHIFT  (29)  /* The number of delay bits co-opted for side-set. Inclusive of the enable bit, if present. */
#define RP2040_PIO0_SM2_PINCTRL_SIDESET_COUNT_MASK   (0x07 << RP2040_PIO0_SM2_PINCTRL_SIDESET_COUNT_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_SET_COUNT_SHIFT      (26)  /* The number of pins asserted by a SET. Max of 5 */
#define RP2040_PIO0_SM2_PINCTRL_SET_COUNT_MASK       (0x07 << RP2040_PIO0_SM2_PINCTRL_SET_COUNT_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_OUT_COUNT_SHIFT      (20)  /* The number of pins asserted by an OUT. Value of 0 -> 32 pins */
#define RP2040_PIO0_SM2_PINCTRL_OUT_COUNT_MASK       (0x3f << RP2040_PIO0_SM2_PINCTRL_OUT_COUNT_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_IN_BASE_SHIFT        (15)  /* The virtual pin corresponding to IN bit 0 */
#define RP2040_PIO0_SM2_PINCTRL_IN_BASE_MASK         (0x1f << RP2040_PIO0_SM2_PINCTRL_IN_BASE_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_SIDESET_BASE_SHIFT   (10)  /* The virtual pin corresponding to delay field bit 0 */
#define RP2040_PIO0_SM2_PINCTRL_SIDESET_BASE_MASK    (0x1f << RP2040_PIO0_SM2_PINCTRL_SIDESET_BASE_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_SET_BASE_SHIFT       (5)  /* The virtual pin corresponding to SET bit 0 */
#define RP2040_PIO0_SM2_PINCTRL_SET_BASE_MASK        (0x1f << RP2040_PIO0_SM2_PINCTRL_SET_BASE_SHIFT)
#define RP2040_PIO0_SM2_PINCTRL_OUT_BASE_MASK        (0x1f)  /* The virtual pin corresponding to OUT bit 0 */

#define RP2040_PIO0_SM3_CLKDIV_INT_SHIFT             (16)  /* Effective frequency is sysclk/int. Value of 0 is interpreted as max possible value */
#define RP2040_PIO0_SM3_CLKDIV_INT_MASK              (0xffff << RP2040_PIO0_SM3_CLKDIV_INT_SHIFT)
#define RP2040_PIO0_SM3_CLKDIV_FRAC_SHIFT            (8)  /* Fractional part of clock divider */
#define RP2040_PIO0_SM3_CLKDIV_FRAC_MASK             (0xff << RP2040_PIO0_SM3_CLKDIV_FRAC_SHIFT)

#define RP2040_PIO0_SM3_EXECCTRL_EXEC_STALLED        (1 << 31)  /* An instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear once the instruction completes. */
#define RP2040_PIO0_SM3_EXECCTRL_SIDE_EN             (1 << 30)  /* If 1, the delay MSB is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction. */
#define RP2040_PIO0_SM3_EXECCTRL_SIDE_PINDIR         (1 << 29)  /* Side-set data is asserted to pin OEs instead of pin values */
#define RP2040_PIO0_SM3_EXECCTRL_JMP_PIN_SHIFT       (24)  /* The GPIO number to use as condition for JMP PIN. Unaffected by input mapping. */
#define RP2040_PIO0_SM3_EXECCTRL_JMP_PIN_MASK        (0x1f << RP2040_PIO0_SM3_EXECCTRL_JMP_PIN_SHIFT)
#define RP2040_PIO0_SM3_EXECCTRL_OUT_EN_SEL_SHIFT    (19)  /* Which data bit to use for inline OUT enable */
#define RP2040_PIO0_SM3_EXECCTRL_OUT_EN_SEL_MASK     (0x1f << RP2040_PIO0_SM3_EXECCTRL_OUT_EN_SEL_SHIFT)
#define RP2040_PIO0_SM3_EXECCTRL_INLINE_OUT_EN       (1 << 18)  /* If 1, use a bit of OUT data as an auxiliary write enable When used in conjunction with OUT_STICKY, writes with an enable of 0 will deassert the latest pin write. This can create useful masking/override behaviour due to the priority ordering of state machine pin writes (SM0 < SM1 < ...) */
#define RP2040_PIO0_SM3_EXECCTRL_OUT_STICKY          (1 << 17)  /* Continuously assert the most recent OUT/SET to the pins */
#define RP2040_PIO0_SM3_EXECCTRL_WRAP_TOP_SHIFT      (12)  /* After reaching this address, execution is wrapped to wrap_bottom. If the instruction is a jump, and the jump condition is true, the jump takes priority. */
#define RP2040_PIO0_SM3_EXECCTRL_WRAP_TOP_MASK       (0x1f << RP2040_PIO0_SM3_EXECCTRL_WRAP_TOP_SHIFT)
#define RP2040_PIO0_SM3_EXECCTRL_WRAP_BOTTOM_SHIFT   (7)  /* After reaching wrap_top, execution is wrapped to this address. */
#define RP2040_PIO0_SM3_EXECCTRL_WRAP_BOTTOM_MASK    (0x1f << RP2040_PIO0_SM3_EXECCTRL_WRAP_BOTTOM_SHIFT)
#define RP2040_PIO0_SM3_EXECCTRL_STATUS_SEL          (1 << 4)  /* All-ones if RX FIFO level < N, otherwise all-zeroes */
#define RP2040_PIO0_SM3_EXECCTRL_STATUS_N_MASK       (0x0f)  /* Comparison level for the MOV x, STATUS instruction */

#define RP2040_PIO0_SM3_SHIFTCTRL_FJOIN_RX           (1 << 31)  /* When 1, RX FIFO steals the TX FIFO's storage, and becomes twice as deep. TX FIFO is disabled as a result (always reads as both full and empty). FIFOs are flushed when this bit is changed. */
#define RP2040_PIO0_SM3_SHIFTCTRL_FJOIN_TX           (1 << 30)  /* When 1, TX FIFO steals the RX FIFO's storage, and becomes twice as deep. RX FIFO is disabled as a result (always reads as both full and empty). FIFOs are flushed when this bit is changed. */
#define RP2040_PIO0_SM3_SHIFTCTRL_PULL_THRESH_SHIFT  (25)  /* Number of bits shifted out of TXSR before autopull or conditional pull. Write 0 for value of 32. */
#define RP2040_PIO0_SM3_SHIFTCTRL_PULL_THRESH_MASK   (0x1f << RP2040_PIO0_SM3_SHIFTCTRL_PULL_THRESH_SHIFT)
#define RP2040_PIO0_SM3_SHIFTCTRL_PUSH_THRESH_SHIFT  (20)  /* Number of bits shifted into RXSR before autopush or conditional push. Write 0 for value of 32. */
#define RP2040_PIO0_SM3_SHIFTCTRL_PUSH_THRESH_MASK   (0x1f << RP2040_PIO0_SM3_SHIFTCTRL_PUSH_THRESH_SHIFT)
#define RP2040_PIO0_SM3_SHIFTCTRL_OUT_SHIFTDIR       (1 << 19)  /* 1 = shift out of output shift register to right. 0 = to left. */
#define RP2040_PIO0_SM3_SHIFTCTRL_IN_SHIFTDIR        (1 << 18)  /* 1 = shift input shift register to right (data enters from left). 0 = to left. */
#define RP2040_PIO0_SM3_SHIFTCTRL_AUTOPULL           (1 << 17)  /* Pull automatically when the output shift register is emptied */
#define RP2040_PIO0_SM3_SHIFTCTRL_AUTOPUSH           (1 << 16)  /* Push automatically when the input shift register is filled */

#define RP2040_PIO0_SM3_ADDR_MASK                    (0x1f)

#define RP2040_PIO0_SM3_INSTR_MASK                   (0xffff)

#define RP2040_PIO0_SM3_PINCTRL_SIDESET_COUNT_SHIFT  (29)  /* The number of delay bits co-opted for side-set. Inclusive of the enable bit, if present. */
#define RP2040_PIO0_SM3_PINCTRL_SIDESET_COUNT_MASK   (0x07 << RP2040_PIO0_SM3_PINCTRL_SIDESET_COUNT_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_SET_COUNT_SHIFT      (26)  /* The number of pins asserted by a SET. Max of 5 */
#define RP2040_PIO0_SM3_PINCTRL_SET_COUNT_MASK       (0x07 << RP2040_PIO0_SM3_PINCTRL_SET_COUNT_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_OUT_COUNT_SHIFT      (20)  /* The number of pins asserted by an OUT. Value of 0 -> 32 pins */
#define RP2040_PIO0_SM3_PINCTRL_OUT_COUNT_MASK       (0x3f << RP2040_PIO0_SM3_PINCTRL_OUT_COUNT_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_IN_BASE_SHIFT        (15)  /* The virtual pin corresponding to IN bit 0 */
#define RP2040_PIO0_SM3_PINCTRL_IN_BASE_MASK         (0x1f << RP2040_PIO0_SM3_PINCTRL_IN_BASE_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_SIDESET_BASE_SHIFT   (10)  /* The virtual pin corresponding to delay field bit 0 */
#define RP2040_PIO0_SM3_PINCTRL_SIDESET_BASE_MASK    (0x1f << RP2040_PIO0_SM3_PINCTRL_SIDESET_BASE_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_SET_BASE_SHIFT       (5)  /* The virtual pin corresponding to SET bit 0 */
#define RP2040_PIO0_SM3_PINCTRL_SET_BASE_MASK        (0x1f << RP2040_PIO0_SM3_PINCTRL_SET_BASE_SHIFT)
#define RP2040_PIO0_SM3_PINCTRL_OUT_BASE_MASK        (0x1f)  /* The virtual pin corresponding to OUT bit 0 */

#define RP2040_PIO0_INTR_SM3                         (1 << 11)
#define RP2040_PIO0_INTR_SM2                         (1 << 10)
#define RP2040_PIO0_INTR_SM1                         (1 << 9)
#define RP2040_PIO0_INTR_SM0                         (1 << 8)
#define RP2040_PIO0_INTR_SM3_TXNFULL                 (1 << 7)
#define RP2040_PIO0_INTR_SM2_TXNFULL                 (1 << 6)
#define RP2040_PIO0_INTR_SM1_TXNFULL                 (1 << 5)
#define RP2040_PIO0_INTR_SM0_TXNFULL                 (1 << 4)
#define RP2040_PIO0_INTR_SM3_RXNEMPTY                (1 << 3)
#define RP2040_PIO0_INTR_SM2_RXNEMPTY                (1 << 2)
#define RP2040_PIO0_INTR_SM1_RXNEMPTY                (1 << 1)
#define RP2040_PIO0_INTR_SM0_RXNEMPTY                (1 << 0)

