yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_pio0.h
#define RP2040_PIO0_IRQ0_INTE_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ0_INTE_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ0_INTE_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ0_INTE_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ0_INTE_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ0_INTE_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ0_INTE_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ0_INTE_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ0_INTE_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ0_INTE_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ0_INTE_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ0_INTE_SM0_RXNEMPTY           (1 << 0)

#define RP2040_PIO0_IRQ0_INTF_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ0_INTF_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ0_INTF_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ0_INTF_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ0_INTF_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ0_INTF_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ0_INTF_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ0_INTF_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ0_INTF_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ0_INTF_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ0_INTF_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ0_INTF_SM0_RXNEMPTY           (1 << 0)

#define RP2040_PIO0_IRQ0_INTS_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ0_INTS_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ0_INTS_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ0_INTS_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ0_INTS_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ0_INTS_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ0_INTS_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ0_INTS_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ0_INTS_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ0_INTS_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ0_INTS_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ0_INTS_SM0_RXNEMPTY           (1 << 0)

#define RP2040_PIO0_IRQ1_INTE_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ1_INTE_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ1_INTE_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ1_INTE_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ1_INTE_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ1_INTE_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ1_INTE_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ1_INTE_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ1_INTE_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ1_INTE_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ1_INTE_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ1_INTE_SM0_RXNEMPTY           (1 << 0)

#define RP2040_PIO0_IRQ1_INTF_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ1_INTF_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ1_INTF_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ1_INTF_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ1_INTF_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ1_INTF_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ1_INTF_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ1_INTF_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ1_INTF_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ1_INTF_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ1_INTF_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ1_INTF_SM0_RXNEMPTY           (1 << 0)

#define RP2040_PIO0_IRQ1_INTS_SM3                    (1 << 11)
#define RP2040_PIO0_IRQ1_INTS_SM2                    (1 << 10)
#define RP2040_PIO0_IRQ1_INTS_SM1                    (1 << 9)
#define RP2040_PIO0_IRQ1_INTS_SM0                    (1 << 8)
#define RP2040_PIO0_IRQ1_INTS_SM3_TXNFULL            (1 << 7)
#define RP2040_PIO0_IRQ1_INTS_SM2_TXNFULL            (1 << 6)
#define RP2040_PIO0_IRQ1_INTS_SM1_TXNFULL            (1 << 5)
#define RP2040_PIO0_IRQ1_INTS_SM0_TXNFULL            (1 << 4)
#define RP2040_PIO0_IRQ1_INTS_SM3_RXNEMPTY           (1 << 3)
#define RP2040_PIO0_IRQ1_INTS_SM2_RXNEMPTY           (1 << 2)
#define RP2040_PIO0_IRQ1_INTS_SM1_RXNEMPTY           (1 << 1)
#define RP2040_PIO0_IRQ1_INTS_SM0_RXNEMPTY           (1 << 0)
